experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run3_vclients4_workerthreads32_client2_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       80543 ops,    1115 (avg:    1150) ops/sec, 4.40MB/sec (avg: 4.53MB/sec),  3.56 (avg:  3.47) msec latency

1         Threads
4         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1150.50          ---          ---      3.47300      4643.46 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1150.50         0.00         0.00      3.47300      4643.46 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.550         0.00
SET       0.560         0.01
SET       0.570         0.02
SET       0.580         0.02
SET       0.590         0.04
SET       0.600         0.06
SET       0.610         0.09
SET       0.620         0.12
SET       0.630         0.17
SET       0.640         0.22
SET       0.650         0.30
SET       0.660         0.42
SET       0.670         0.56
SET       0.680         0.71
SET       0.690         0.90
SET       0.700         1.12
SET       0.710         1.35
SET       0.720         1.61
SET       0.730         1.93
SET       0.740         2.30
SET       0.750         2.69
SET       0.760         3.15
SET       0.770         3.64
SET       0.780         4.16
SET       0.790         4.76
SET       0.800         5.37
SET       0.810         6.04
SET       0.820         6.72
SET       0.830         7.42
SET       0.840         8.19
SET       0.850         9.03
SET       0.860         9.83
SET       0.870        10.69
SET       0.880        11.57
SET       0.890        12.47
SET       0.900        13.45
SET       0.910        14.42
SET       0.920        15.40
SET       0.930        16.36
SET       0.940        17.34
SET       0.950        18.36
SET       0.960        19.40
SET       0.970        20.42
SET       0.980        21.42
SET       0.990        22.47
SET       1.000        27.87
SET       1.100        36.56
SET       1.200        42.95
SET       1.300        47.48
SET       1.400        50.59
SET       1.500        52.69
SET       1.600        54.18
SET       1.700        55.41
SET       1.800        56.37
SET       1.900        57.14
SET       2.000        57.68
SET       2.100        58.13
SET       2.200        58.58
SET       2.300        58.96
SET       2.400        59.31
SET       2.500        59.60
SET       2.600        59.85
SET       2.700        60.11
SET       2.800        60.31
SET       2.900        60.54
SET       3.000        60.73
SET       3.100        60.95
SET       3.200        61.15
SET       3.300        61.35
SET       3.400        61.53
SET       3.500        61.72
SET       3.600        61.90
SET       3.700        62.09
SET       3.800        62.27
SET       3.900        62.44
SET       4.000        62.60
SET       4.100        62.79
SET       4.200        63.00
SET       4.300        63.22
SET       4.400        63.42
SET       4.500        63.62
SET       4.600        63.86
SET       4.700        64.09
SET       4.800        64.33
SET       4.900        64.61
SET       5.000        64.87
SET       5.100        65.16
SET       5.200        65.41
SET       5.300        65.73
SET       5.400        66.11
SET       5.500        66.53
SET       5.600        66.99
SET       5.700        67.47
SET       5.800        68.01
SET       5.900        68.66
SET       6.000        69.36
SET       6.100        70.15
SET       6.200        70.99
SET       6.300        72.07
SET       6.400        73.23
SET       6.500        74.45
SET       6.600        75.83
SET       6.700        77.25
SET       6.800        78.91
SET       6.900        80.58
SET       7.000        82.24
SET       7.100        83.86
SET       7.200        85.52
SET       7.300        87.13
SET       7.400        88.61
SET       7.500        89.94
SET       7.600        91.24
SET       7.700        92.28
SET       7.800        93.16
SET       7.900        93.93
SET       8.000        94.50
SET       8.100        94.99
SET       8.200        95.47
SET       8.300        95.84
SET       8.400        96.12
SET       8.500        96.40
SET       8.600        96.65
SET       8.700        96.87
SET       8.800        97.09
SET       8.900        97.26
SET       9.000        97.40
SET       9.100        97.51
SET       9.200        97.62
SET       9.300        97.73
SET       9.400        97.84
SET       9.500        97.94
SET       9.600        98.04
SET       9.700        98.12
SET       9.800        98.20
SET       9.900        98.27
SET      10.000        98.57
SET      11.000        98.92
SET      12.000        99.14
SET      13.000        99.32
SET      14.000        99.48
SET      15.000        99.69
SET      16.000        99.83
SET      17.000        99.87
SET      18.000        99.89
SET      19.000        99.92
SET      20.000        99.94
SET      21.000        99.95
SET      22.000        99.97
SET      23.000        99.97
SET      24.000        99.98
SET      26.000        99.98
SET      27.000        99.99
SET      28.000        99.99
SET      29.000        99.99
SET      30.000       100.00
SET     190.000       100.00
SET     200.000       100.00
---
---